"""
Indexing (From empty to empty)

indexing ရှိတယ်လို့ယူဆပြီး first five, last five တွေ သုံးတတ်အောင်သင်ရမယ်။ သုံးတတ်ပြီဆိုရင်တော့ indexing ဟာ စိတ်ကူးနဲ့ပုံဖော်ထားခြင်းသာဖြစ်ပြီး တကယ်မရှိကြောင်း နားလည်သွားရမယ်။ indexing အသုံးပြုနိုင်ဖို့ ဖန်တီးပေးထားတဲ့ နောက်ကွယ်က ပုံသေနည်းတွေကို နားလည်ရမှာဖြစ်သလို ကိုယ်တိုင်လည်း ပုံသေနည်းတွေဖန်တီးပြီး indexing လိုမျိုး တကယ်မရှိတာကနေ ရှိအောင်ဖန်တီးတတ်ရပါမယ်။ 

ဒါကို ဗလာမှ ဗလာသို့ (မရှိခြင်းမှ ရှိခြင်းသို့ ရှိခြင်းမှ မရှိခြင်းသို့) ဆိုတာမျိုး သံသရာတပတ်ပြည့်တယ်လို့ ခေါ်ပါတယ်။
တကယ်တော့ data types တွေရော operators တွေရော တကယ်မရှိကြပါဘူး။ မရှိတဲ့အကြောင်းကို သင်ဖို့က ကျွမ်းကျွမ်းကျင်ကျင်ရေးတတ်ပြီဆိုမှသာ သင်လို့ရပါမယ်။
အခုက indexing တစ်ခုတည်းကိုပဲ ဥပမာပေးပြီး အရင်ပြောပြထားတာဖြစ်ပါတယ်။

တကယ်တော့ Programming တင်မကပဲ ပညာရပ်အားလုံးအပါအဝင် ကျွန်တော်တို့ရဲ့ ဦးနှောက်ကြီးကိုယ်တိုင်က တကယ်မရှိတာကို ပုံဖော်ထားကြတာဖြစ်ပါတယ်။
အရောင်တွေက တကယ်မရှိပေမယ့် ဦးနှောက်က လှည့်စားပြီး ရှိသယောင်ဖြစ်နေသလို ကမ္ဘာဟာ လည်နေပေမယ့် ရပ်သလို လှည့်စားထားသလိုမျိုးတွေပါ။
အရှေ့အနောက်တောင်မြောက်မရှိပေမယ့် ရှိသယောင် သတ်မှတ်ကြတာမျိုး ၊ Civilization ဖြစ်ဖို့ ကောင်းမှု ၊ မကောင်းမှုတွေ ဖန်တီးထားကြတာမျိုး ၊ ကုန်ပစ္စည်းလဲလှယ်ရလွယ်ကူဖို့ စက္ကူကို ပိုက်ဆံဆိုပြီး တန်ဖိုးရှိသယောင် သတ်မှတ်ကြတာမျိုး ၊ တကယ်မရှိတဲ့ နံပါတ်တွေကို ငွေကြေးတစ်ခုလိုမျိုးဖန်တီးထားတဲ့ digital ငွေကြေး ၊ online banking လိုမျိုး စသဖြင့် အရာရာဟာ ဗလာမှ ဗလာသို့ဆိုတာမျိုး တွေးနိုင်ရင် စည်းမျဉ်းတွေကို ကျော်ပြီး မြင်နိုင်စွမ်းရှိလာမှာဖြစ်ပြီး အရာရာကို သင်လွယ်တတ်လွယ်ဖြစ်သွားပါမယ်။

သင်မြင်နေတဲ့ ကမ္ဘာကြီးဟာ အစစ်အမှန်မဟုတ်သလို သင်ကိုယ်တိုင်လည်း အစစ်အမှန်မဟုတ်ပါဘူး။
ကိုယ်ပိုင်လို့ ထင်ထားကြတဲ့ အတွေးတွေကအစ ရိုးရာယဉ်ကျေးမှု ၊ ဘာသာအယူဝါဒ၊ နိုင်ငံရေးစနစ် ၊ ပညာရေးစနစ် စသဖြင့် စနစ်တကျပုံသွင်းခံထားရပြီး ဘောင်ထဲကနေပဲ တွေးမိနေတတ်ကြပါတယ်။
အခုဆိုရင်တောင် ဒီစာဖတ်ပြီး ကျွန်တော်ပုံသွင်းတာကို ခံလိုက်ရပြန်ပါပြီ။

ကျွန်တော်ကိုယ်တိုင်ကလည်း အဘိဓမ္မာနဲ့ တောက်တယ်ကျင်းနှစ်ခုရောပြီး ဒီလိုအတွေးဖြစ်လာခဲ့တာဆို‌တော့ ဗုဒ္ဓနဲ့ လောင်ဇီရဲ့ ပုံသွင်းခံလိုက်ရတာပေါ့။
တကယ်တော့ ဗုဒ္ဓနဲ့ လောင်ဇီဆိုတာကလည်း အစစ်အမှန်အမည်မဟုတ်ပြန်ပါဘူး။
ဗုဒ္ဓဆိုတာက ပါဠိအသံထွက်ဖြစ်ပြီး မြန်မာလို ဘုရားလို့ ခေါ်ပါတယ်။
လောင်ဇီဆိုတာကလည်း လေးစားသမှုနဲ့ခေါ်ကြတဲ့ တရုတ်အသံထွက်ဖြစ်ပြီး မြန်မာလို ဆရာလို့ အဓိပ္ပါယ်ရပါတယ်။
တကယ်‌တော့ ဗုဒ္ဓဆိုတာကလည်း သွယ်ဝိုက်အဓိပ္ပါယ်အရ ဆရာပါပဲ။

ဒီလိုမျိုး ဘာမှတကယ်မရှိဘူးဆိုတာကို သိတာနဲ့ မသိတာ ဘာကွာလဲဆိုရင် ဘာမှမကွာပါဘူး။
ဒါပေမယ့် စိတ်ထွက်ပေါက်ရပါတယ်။
မရှိတာတွေကို အရမ်းမဖက်တွယ်တော့ပဲ သဘာဝနဲ့အတူ ပျော်ပျော်ရွှင်ရွှင် စီးမြောနိုင်တာပေါ့။

ဒီလိုပါပဲ indexing တကယ်မရှိတာကို သိလို့လည်း ဘာမှအကျိုးမရှိပါဘူး။
ဒါပေမယ့် program ရေးတဲ့အခါ စိတ်ဖိအားမရှိတော့ပဲ  သက်တောင့်သက်သာနဲ့ စီးမြောနိုင်တာပေါ့။
စည်းမျဉ်းတွေကိုကျော်ပြီး မြင်နိုင်လာတဲ့အတွက် Idea အသစ်တွေထွက်ပြီး နည်းပညာအသစ်တွေလည်း ဖန်တီးလာနိုင်မှာပေါ့။

အခုက AI ခေတ်ဆိုတော့ code ရေးတာ ဒါမှမဟုတ် အဟောင်းတွေပြန်ဖန်တီးတာ ရှိပြီးသားတွေကို လေ့ကျင့်တာက အရေးမပါတော့ပါဘူး။
ကမ္ဘာကို အုပ်စိုးထားနိုင်တဲ့ လူတွေရဲ့ လျှို့ဝှက်ချက်တစ်ခုဖြစ်တဲ့ မရှိတာကို ရှိသယောင် ပုံဖော် ဖန်တီးနိုင်စွမ်းဆိုတာကပဲ အရေးပါလာပါတော့မယ်။

ဒါကြောင့် သင်တန်းကာလကို နှစ်လကနေ သုံးလတိုးပြီး အပိုတစ်လ လက်ဆောင်ပေးပါ့မယ်။

"""