"""

indexing

အစဉ်လိုက်သိမ်းထားတဲ့ data အစုအဝေးတွေနဲ့ပတ်သတ်ပြီး အထဲက data တွေကို တစ်ခုချင်းထုတ်ယူချင်တဲ့အခါ တည်နေရာနံပါတ်တွေကို အသုံးပြုနိုင်ပါတယ်။

တည်နေရာနံပါတ်တွေကို index number လို့ ခေါ်ပြီး index number တွေကို သုံးပြီး အလုပ်လုပ်တာကိုတော့ indexing လို့ ခေါ်ပါတယ်။

################################################

Positive index and Negative index 

data တစ်ခုချင်းစီမှာ တည်နေရာနံပါတ်နှစ်ခုစီ ရှိကြပါတယ်။

ဘယ်ဘက်ကစပြီး ရေတွက်တာကို အပေါင်းတည်နေရာနံပါတ်လို့ သတ်မှတ်ပြီး ညာဘက်ကစပြီး ရေတွက်ရင်တော့ အနှုတ်တည်နေရာနံပါတ်လို့ သတ်မှတ်ပါတယ်။

################################################

Positive index 

x = "abcdefg"

x ဆိုတဲ့ စာကြောင်းမှာ စာလုံး ခုနှစ်လုံး ပါဝင်ပါတယ်။

data ခုနှစ်ခုပေါ့။

ဘယ်ဘက်ကရေတွက်ရင် ပထမဆုံးဖြစ်တဲ့ a ရဲ့ အပေါင်းတည်နေရာနံပါတ်ဟာ 0 ဖြစ်ပါတယ်။

ဘယ်ကြောင့်လဲဆိုတော့ ဘယ်ကနေ ရေတွက်တဲ့အခါ zero က စပြီး ရေတွက်တာဖြစ်လို့ပါ။

ဒုတိယဖြစ်တဲ့ b ရဲ့ တည်နေရာနံပါတ်ကတော့ 1 ဖြစ်ပါမယ်။

တတိယဖြစ်တဲ့ c ရဲ့ တည်နေရာနံပါတ်ကတော့ 2 ဖြစ်ပါမယ်။

################################################

a  b  c  d  e  f  g

0  1  2  3  4  5  6        ( + )

ခုလိုမျိုး ဖြစ်ပါမယ်။

################################################

Exercises အနေနဲ့ 

ဘယ်ဘက်က ရေတွက်ရင်

1. ငါးခုမြောက်ရဲ့ တည်နေရာနံပါတ်ကို ခန့်မှန်းပါ။

2. ဆယ်ခုမြောက်ရဲ့ တည်နေရာနံပါတ်ကို ခန့်မှန်းပါ။

3. တစ်ထောင်မြောက်ရဲ့ တည်နေရာနံပါတ်ကို ခန့်မှန်းပါ။

4. ဒီအဖြေတွေကို ဘယ်လိုခန့်မှန်းလိုက်တာလည်း ရှင်းပြပေးပါ။

################################################

Negative index 

x = "abcdefg"

ညာဘက်က ရေတွက်ရင် တစ်ကနေစပြီး ရေတွက်ပါတယ်။

ညာဘက်ကစပြီး ရေတွက်တဲ့အခါ ဘယ်ဘက်ကစပြီး ရေတွက်တဲ့တစ်နဲ့ ရောကုန်မှာစိုးလို့ အနှုတ်တစ်ဆိုပြီး အနှုတ်သင်္ကတနဲ့ ခွဲခြားပါတယ်။

ဘာကြောင့် သုညကမစပဲ တစ်ကစပြီးရေတွက်သလဲဆိုတော့ သုညကို အပေါင်းအနှုတ်ဆိုပြီး နှစ်ခုခွဲလို့ မရလို့ပါ။

ဒါကြောင့် ညာဘက်ကရေတွက်ရင် ပထမဆုံးဖြစ်တဲ့ g ရဲ့ အနှုတ်တည်နေရာနံပါတ်ဟာ 1 ဖြစ်ပါတယ်။ 

အတိအကျပြောရရင်တော့ -1 ပေါ့။

ဒုတိယဖြစ်တဲ့ f ရဲ့ တည်နေရာနံပါတ်ကတော့ 2 ဖြစ်ပါမယ်။

တတိယဖြစ်တဲ့ e ရဲ့ တည်နေရာနံပါတ်ကတော့ 3 ဖြစ်ပါမယ်။

################################################

a  b  c  d  e  f  g

7  6  5  4  3  2  1        (  -  )

ခုလိုမျိုး ဖြစ်ပါမယ်။

################################################

Exercises အနေနဲ့ 

ညာဘက်က ရေတွက်ရင်

1. ငါးခုမြောက်ရဲ့ တည်နေရာနံပါတ်ကို ခန့်မှန်းပါ။

2. ဆယ်ခုမြောက်ရဲ့ တည်နေရာနံပါတ်ကို ခန့်မှန်းပါ။

3. တစ်ထောင်မြောက်ရဲ့ တည်နေရာနံပါတ်ကို ခန့်မှန်းပါ။

4. ဒီအဖြေတွေကို ဘယ်လိုခန့်မှန်းလိုက်တာလည်း ရှင်းပြပေးပါ။

################################################

သတိထားရမှာတစ်ခုက data တစ်ခုစီမှာ index number နှစ်ခုရှိတယ်ဆိုတာပါပဲ။

"abcdefg" မှာ 

1. a ရဲ့ positive index နဲ့ negative index ကို ရှာပါ။

2. d ရဲ့ positive index နဲ့ negative index ကို ရှာပါ။

3. g ရဲ့ positive index နဲ့ negative index ကို ရှာပါ။

################################################

a  b  c  d  e  f  g

0  1  2  3  4  5  6        ( + )

7  6  5  4  3  2  1        (  -  )

ခုလိုမျိုး data တစ်ခုစီမှာ တည်နေရာနံပါတ် နှစ်ခုစီရှိတာကို နားလည်ပြီး နံပါတ်တွေကို ရှာတတ်ပြီဆိုရင်တော့ slicing ကို ဆက်ပြီးသင်လို့ ရပါပြီ။

################################################

တကယ်တော့ တည်နေရာနံပါတ်ဆိုတာတွေဟာ တကယ်မရှိပါဘူး။

ထည့်ပေးလိုက်တဲ့ index number ကို ပုံသေနည်းတွေသုံးပြီး memory address တွေ တွက်ပြီး data တွေ ထုတ်ပေးနေတာပါ။

ထည့်ရေးရင် ရှုတ်ကုန်မှာစိုးလို့ data type စာအုပ်မှပဲ အသေးစိတ် ရေးပေးပါ့မယ်။

################################################

"""