

"""

Selection ( if elif else )

################################################

28. Statement 

ကွန်ပြူတာကို တစ်ခုခု ညွှန်ကြားလိုက်တာကို ပြောတာပါ။

Computer ဖွင့်ပါဆိုတာမျိုးပေါ့။

ညွှန်ကြားချက်/အမိန့်တွေကို ပုံမှန်အားဖြင့်တော့ လုပ်ကို လုပ်ရမယ်ဆိုတာမျိုး လိုက်နာရပါတယ်။

ပုံမှန်ညွှန်ကြားချက်တွေကို normal statement လို့လည်း ခေါ်ကြပါတယ်။

တကယ့်လက်တွေ့မှာတော့ တစ်ချို့အမိန့်တွေဟာ အမြဲတမ်းလုပ်နေစရာမလိုပဲ အခြေအနေပေါ်မူတည်ပြီး လုပ်ရတာမျိုး ရှိနိုင်ပါတယ်။

################################################

Conditional statement 

condition ဆိုတာက အခြေအနေကို ပြောတာဖြစ်ပြီး statement ကတော့ ညွှန်ကြားချက်ဖြစ်ပါတယ်။

ဆီလျှော်အောင် ဘာသာပြန်ရရင် အခြေအနေပေါ်မူတည်ပြီး ပေးထားတဲ့ ညွှန်ကြားချက်ပေါ့။

computer ဖွင့်ခိုင်းတဲ့အခါ  battery အားကုန်နေရင်တော့ မဖွင့်သင့်ဘူးဆိုတာမျိုးပေါ့။

ဒီလိုမျိုးရေးချင်ရင် ပုံမှန်အမိန့်ရဲ့ရှေ့မှာ အခြေအနေတစ်ခုကို အပိုထပ်ထည့်ပေးလိုက်ရုံပါပဲ။

################################################

ရိုးရိုး ရေးတာနဲ့ ဘာကွာလဲဆိုတော့

p0  

လို့ ရေးရင် သာမန်ညွှန်ကြားချက်ဖြစ်လို့ သေချာပေါက် အလုပ်လုပ်ပါမယ်။

################################################

if battery_power > 5: p0

အပေါ်ကလို ရေးရင်တော့ battery ရဲ့ power က 5 % ထက်ကျော်မှသာ p0 အလုပ်လုပ်ပါမယ်။

################################################

Python ဟာ English စာနဲ့ အနီးစပ်ဆုံးတူအောင် ဖန်တီးထားတာဖြစ်လို့ English လို တွေးနိုင်ရင်ပဲ ရေးလို့ ရပါတယ်။

If the battery power is greater than 5, turn on the computer.

if battery_power > 5: p0

################################################

တစ်ခုခုလုပ်ရမယ့် program ဟာ p0 ပဲ ဆိုကြပါစို့။

ဒီလိုတွေးပြီး ရေးနိုင်ပါတယ်။

1. If the temperature is below 10, activate the heater.
if temperature < 10: p0

2. If the score is equal to 100, show a congratulatory message.
if score == 100: p0

3. If the time is after 6 PM, send a reminder.
if time > 18: p0

################################################

Exercises အနေနဲ့ အပေါ်ကလိုမျိုး 10 ခု ရေးပါ။ 

################################################



29. if statement 

conditional statement တွေကို if နဲ့ ရေးထားခဲ့ရင် if statement လို့ ခေါ်ကြပါတယ်။

################################################

if နဲ့ ပတ်သတ်ပြီး မှတ်ထားရမယ့် အချက်သုံးချက်ရှိပါတယ်။

ပထမဆုံး သူနဲ့ ချိတ်ဆက်ထားတဲ့ အခြေအနေကို သိရပါမယ်။

ဒုတိယအနေနဲ့ သူနဲ့ချိတ်ဆက်ထားတဲ့ ညွှန်ကြားချက် / အမိန့်တွေကို သိရပါမယ်။

တတိယအနေနဲ့ ချိတ်ဆက်ထားတဲ့ အခြေအနေမှန်မှသာ ချိတ်ဆက်ထားတဲ့ ညွှန်ကြားချက်ကို ဘာသာပြန်ပေးမယ်ဆိုတာကို သိထားရပါမယ်။

################################################

အလွယ်မှတ်ရင်တော့ မှန်ရင် အလုပ်လုပ်တယ်ဆိုတာပါပဲ။

################################################

အခြေအနေခြောက်ခုနဲ့ program ခြောက်ခုရှိတယ်ဆိုပါစို့။

c1 = battery_power > 5
c2 = battery_power < 20
c3 = battery_power > 50
c4 = battery_power > 80
c5 = signal of power ON key
c6 = signal of power OFF key

p0 = turn on the computer
p1 = turn off the computer.
p2 = open video player 
p3 = close video player 
p4 = power saved mode ON
p5 = power saved mode OFF
p6 = close all applications

Exercises အနေနဲ့ condition နဲ့ statement ကို ရှာပြီး အဓိပ္ပါယ်ကိုလည်း ရေးပေးရပါမယ်။

နမူနာဖြေပြထားတဲ့အတိုင်း ဖြေရပါမယ်။

################################################

question.1  

 --->   if c1: p0

if နှင့် ချိတ်ဆက်ထားသော condition သည် c1 ဖြစ်ပါသည်။

if နှင့် ချိတ်ဆက်ထားသော program သည် p0 ဖြစ်ပါသည်။

အဓိပ္ပါယ်မှာ battery ပမာဏ 5% ထက်ပိုများမှသာ computer ဖွင့်ခိုင်းသည့် အမိန့်ကို လိုက်နာမည်ဟူ၍ဖြစ်ပါသည်။

If the battery power is greater than 5, turn on the computer.

################################################

question.2   

--->   if c2: p4

if နှင့် ချိတ်ဆက်ထားသော condition သည် c2 ဖြစ်ပါသည်။

if နှင့် ချိတ်ဆက်ထားသော program သည် p4 ဖြစ်ပါသည်။

အဓိပ္ပါယ်မှာ battery ပမာဏ 20% ထက်ပိုနည်းမှသာ power saved mode ဖွင့်ခိုင်းသည့် အမိန့်ကို လိုက်နာမည်ဟူ၍ ဖြစ်ပါသည်။

If the battery power is lower than 5, power saved mode ON.

################################################

question.3   --->    if c3: p5

################################################

question.4   --->    if c5: p0

################################################

question.5   --->    if c6: p6  p1

################################################
################################################


30. else statement 

conditional statement တွေကို else နဲ့ ရေးထားခဲ့ရင် else statement လို့ ခေါ်ကြပါတယ်။

if ကို တစ်ခုခု "ဖြစ်ခဲ့ရင်" လို့ ဘာသာပြန်ခဲ့မယ်ဆိုရင်

else ကိုတော့ တစ်ခုခု "မဖြစ်ခဲ့ရင်" လို့ ဘာသာပြန်ရမယ်ထင်ပါတယ်။

################################################

else နဲ့ ပတ်သတ်ပြီး မှတ်ထားရမယ့် အချက်သုံးချက်ရှိပါတယ်။

ပထမဆုံး သူနဲ့ ချိတ်ဆက်ထားတဲ့ အခြေအနေကို သိရပါမယ်။

ဒုတိယအနေနဲ့ သူနဲ့ချိတ်ဆက်ထားတဲ့ ညွှန်ကြားချက် / အမိန့်တွေကို သိရပါမယ်။

တတိယအနေနဲ့ ချိတ်ဆက်ထားတဲ့ အခြေအနေမှားမှသာ ချိတ်ဆက်ထားတဲ့ ညွှန်ကြားချက်ကို ဘာသာပြန်ပေးမယ်ဆိုတာကို သိထားရပါမယ်။

################################################

အလွယ်မှတ်ရင်တော့ မှားရင် အလုပ်လုပ်တယ်ဆိုတာပါပဲ။

တစ်ခုသတိထားရမှာက else ကို if, for, while စတဲ့ တစ်ခြားအရာတွေနဲ့ တွဲသုံးရတာဖြစ်လို့ အတူတွဲသုံးထားတဲ့ အရာတွေရဲ့ အခြေအနေတွေကို သူနဲ့ချိတ်ဆက်ထားတဲ့ အခြေအနေလို့ ယူဆရပါမယ်။

################################################

အခြေအနေခြောက်ခုနဲ့ program 11 ခု ရှိတယ်ဆိုပါစို့။

c1 = battery_power > 5
c2 = battery_power < 20
c3 = battery_power > 50
c4 = battery_power > 80
c5 = signal of power ON key
c6 = signal of power OFF key

p0 = turn on the computer
p1 = turn off the computer.
p2 = open video player 
p3 = close video player 
p4 = power saved mode ON
p5 = power saved mode OFF
p6 = close all applications
p7 = normal use of battery power 
p8 = warning that the battery is low
p9 = use CMOS battery to save date and time
p10 = charging CMOS battery

Exercises အနေနဲ့ else နဲ့ သက်ဆိုင်တဲ့ condition နဲ့ statement ကို ရှာပြီး အဓိပ္ပါယ်ကိုလည်း ရေးပေးရပါမယ်။

နမူနာဖြေပြထားတဲ့အတိုင်း ဖြေရပါမယ်။

################################################

question.1  

if c1 : p0

else : p1

else နှင့် ချိတ်ဆက်ထားသော condition သည် c1 ဖြစ်ပါသည်။

else နှင့် ချိတ်ဆက်ထားသော program သည် p1 ဖြစ်ပါသည်။

အဓိပ္ပါယ်မှာ battery ပမာဏ 5% ထက်ပိုများသော အခြေအနေမဟုတ်ခဲ့ပါက computer ပိတ်ခိုင်းသည့် အမိန့်ကို လိုက်နာမည်ဟူ၍ဖြစ်ပါသည်။

################################################

question.2   

if c2 : p4

else : p7

else နှင့် ချိတ်ဆက်ထားသော condition သည် c2 ဖြစ်ပါသည်။

else နှင့် ချိတ်ဆက်ထားသော program သည် p7 ဖြစ်ပါသည်။

အဓိပ္ပါယ်မှာ battery ပမာဏ 20% ထက်ပိုနည်းသော အခြေအနေမဟုတ်ခဲ့ပါက power ကို ပုံမှန်အတိုင်းအသုံးပြုခိုင်းသည့် အမိန့်ကို လိုက်နာမည်ဟူ၍ ဖြစ်ပါသည်။

################################################

question.3   

if c3 : p5

else : p8

################################################

question.4 

if c5 : p0

else : p9

################################################

question.5

if c6 : p6  p1

else : p10

################################################
################################################


31. if else statement 

အခြအနေပေါ်မူတည်ပြီး ညွှန်ကြားချက်နှစ်ခုထဲက တစ်ခုကို ရွေးချယ်စေလိုတဲ့အခါ အသုံးပြုပါတယ်။

################################################

battery ပမာဏ 10% ထက် နည်းနေသလားဆိုတဲ့ အခြေအနေပေါ်မူတည်ပြီး computer ပိတ် / ဖွင့်ဆိုတဲ့ ညွှန်ကြားချက်နှစ်ခုထဲက တစ်ခုကို ရွေးချယ်စေလိုပါက ခုလိုရေးသားနိုင်ပါတယ်။

if battery < 10: close computer

else: open computer 

################################################

battery ပမာဏ 10% ထက် များနေသလားဆိုတဲ့ အခြေအနေပေါ်မူတည်ပြီး computer ဖွင့် / ပိတ်ဆိုတဲ့ ညွှန်ကြားချက်နှစ်ခုထဲက တစ်ခုကို ရွေးချယ်စေလိုပါက ခုလိုရေးသားနိုင်ပါတယ်။

if battery > 10: open computer

else: close computer 

‌################################################

တကယ့်လက်တွေ့မှာက အခြေအနေတွေကို ကိုယ့်ဘာသာပဲ တွေးရပါတယ်။

စာမေးပွဲ ကျလား / အောင်လား စစ်ချင်ရင် ဒီလိုတွေးနိုင်ပါတယ်။

အောင်မှတ်က ဘယ်လောက်လဲ။ 
လေးဆယ်လား ၊ ငါးဆယ်လား။

################################################

အောင်မှတ်က ငါးဆယ်ဖြစ်ခဲ့ရင် ငါးဆယ်ထက်နည်းရင် ကျမယ်။
မနည်းခဲ့ရင်တော့ အောင်မယ်။

ဒါကို program ရေးရင်တော့ ခုလိုဖြစ်ပါမယ်။

if mark < 50: fail exam

else: pass exam

################################################

နောက်တစ်နည်းနဲ့ ထပ်တွေးလို့လည်း ရပါတယ်။

အောင်မှတ်က ငါးဆယ်ဖြစ်ခဲ့ရင် ငါးဆယ် ဒါမှမဟုတ် ငါးဆယ်ထက်များရင် အောင်မယ်။
မများခဲ့ရင်တော့ ကျမယ်။

ဒါကို program ရေးရင်တော့ ခုလိုဖြစ်ပါမယ်။

if mark >= 50: pass exam
else: fail exam

################################################

ခုလိုမျိုး တွေးတဲ့အပေါ်မှာ မူတည်ပြီး ရေးပုံရေးနည်း ကွာသွားတာရှိပေမယ့် ဘယ်နည်းက မှန်တယ်ဆိုတာမျိုးတော့ မရှိပါဘူး။

ကိုယ်ကြိုက်သလို တွေးပြီး ရေးနိုင်ပါတယ်။

သင်ခါစမှာတော့ တွေးတတ်တဲ့အကျင့်လေး ရှိသွားရင်ပဲ အတော်လေး ဟုတ်နေပါပြီ။

################################################

ကိုယ့်ဘာသာ တွေးရတဲ့အခါမှာလည်း ဆန်းဆန်းပြားပြားတွေထက် ရိုးရိုးလေးတွေးနိုင်မှသာ ရေးရတာ ပိုလွယ်သလို ပိုပြီးလည်း ထိရောက်မယ်ဆိုတာမျိုး သတိပေးပါ။

################################################

conditional statement ကို အနှစ်ချုပ်ရရင်တော့ condition တွေကို ဘယ်လို တွေးမလဲဆိုတာပါပဲ။

ဘာကြောင့်လဲဆိုတော့ အမှတ် 50 ကျော်ရင် စားမေးပွဲအောင်သလိုမျိုး အခြေအနေတစ်ခုတည်းကိုပဲ အမြဲကြုံနေရမှာ မဟုတ်ပါဘူး။

ခပ်ကြီးကြီး ဥပမာပေးရရင်  အာကာသယဉ်တစ်စီးလွှတ်တင်ဖို့အတွက် ကိုက်ညီရမယ့် အခြေအနေတွေ ၊ စစ်ဆေးရမယ့် အစိတ်အပိုင်းတွေဟာ သိန်းနဲ့ချီပြီး ရှိနေကြပါတယ်။

ဒါကြောင့် ရှုတ်ထွေးတဲ့အခြေအနေတွေကို နားလည်နိုင်ဖို့အတွက် condition တွေကို သီးသန့် လေ့ကျင့်ပေးပါ့မယ်။

################################################
################################################

33. elif statement 

else နဲ့ if နှစ်မျိုးပေါင်းထားလို့ elif လို့ ခေါ်ပါတယ်။

################################################

if နဲ့ else ကိုသုံးပြီး နှစ်ခုတည်းက တစ်ခုရွေးတာမျိုး လေ့ကျင့်ခဲ့ကြပါတယ်။

တကယ့်လက်တွေ့မှာက အခြေအနေတစ်ခုနဲ့ program နှစ်ခုပဲ ရှိနေတာမဟုတ်ပါဘူး။

################################################

battery 50% အောက်ဆိုရင် အားသွင်းတဲ့အခါ fast charging mode နဲ့ သွင်းမယ်။

50 နဲ့ 80 ကြားဆိုရင် normal speed နဲ့ အားသွင်းမယ်။

80% ကျော်လာရင် အားသွင်းတဲ့အခါ ဖြည်းဖြည်းချင်းသွင်းမယ်။

100 % ဖြစ်သွားရင် အားသွင်းတာရပ်မယ်။

စသဖြင့် battery ရဲ့ အခြေအနေအများကြီးရှိနိုင်သလို လုပ်ဆောင်ရမယ့် program ကလည်း အများကြီးရှိနိုင်ပါတယ်။

ခုလိုမျိုး အခြေအနေအသစ်တွေနဲ့ program အသစ်တွေ ထပ်ထည့်နိုင်ဖို့အတွက် elif ကို ဖန်တီးပေးထားပါတယ်။

################################################

else ဆိုတာက သူနဲ့ ချိတ်ဆက်ထားတဲ့ အခြေအနေ False ဖြစ်ရင် အသက်ဝင်ပြီး if ကတော့ သူနဲ့ ချိတ်ဆက်ထားတဲ့ အခြေအနေ True ဖြစ်ရင် အသက်ဝင်ပါတယ်။

else နဲ့ if ကို ပေါင်းထားတဲ့ elif ကြတော့ else ရဲ့ အခြေအနေမှားပြီး if ရဲ့ အခြေအနေမှန်ရင် အသက်ဝင်ပါတယ်။

################################################

ရှင်းပြတာထက် ရေးပြလိုက်တာက ပိုနားလည်လွယ်မယ်ထင်ပါတယ်။

ကိန်းဂဏန်းနှစ်ခုမှာ ကြီး ၊ ငယ် ၊ ညီ ဆိုတဲ့  ဖြစ်နိုင်ခြေ သုံးခုရှိပါတယ်။

မကြီးရင် ငယ်မယ်ဆိုတာမျိုး ယူဆလို့ မရပါဘူး။

မကြီးပေမယ့် တန်ဖိုးတူနေတာလည်း ရှိနိုင်ပါသေးတယ်။

################################################

ဒါကို ဒီလိုရေးနိုင်ပါတယ်။

c1 = n1 > n2
c2 = n2 > n1

if c1 : First number is greater number.

elif c2 : Second number is greater number.

else: They are equal.

################################################

if နဲ့ ချိတ်ဆက်ထားတဲ့ အခြေအနေက c1 ဖြစ်ပါတယ်။

elif ထဲက else နဲ့ ချိတ်ဆက်ထားတဲ့ အခြေအနေကလည်း c1 ပါပဲ။
elif ထဲက if ချိတ်ဆက်ထားတဲ့ အခြေအနေကတော့ c2 ဖြစ်ပါတယ်။

else နဲ့ ချိတ်ဆက်ထားတာကတော့ c1, c2 နှစ်ခုလုံး ဖြစ်ပါတယ်။

################################################

ပထမအခြေအနေမှန်ခဲ့ရင် if အသက်ဝင်ပြီး First number is greater number. ဆိုတဲ့ program အလုပ်လုပ်ပါမယ်။

ပထမအခြေအနေမှားခဲ့ရင် elif ထဲက else အသက်ဝင်ပြီး
elif ထဲက if ရဲ့ အခြေအ‌နေကို စစ်ဆေးပါမယ်။
ပထမအခြေအနေ မမှားခဲ့ရင်တော့  ဒုတိယအခြေအနေကို မစစ်တော့ပါဘူး။

ဆိုလိုတာက ပထမအခြေအနေမှားပြီး ဒုတိယအခြေအနေမှန်မှသာ elif အသက်ဝင်ပြီး Second number is greater number. ဆိုတဲ့ program အလုပ်လုပ်မှာပါ။

အခြေအနေအားလုံးမှားခဲ့ရင်တော့ else အသက်ဝင်ပါမယ်။
ဘယ်သူမှ ပိုမကြီးရင်တော့ တန်ဖိုးတွေက တူနေကြမယ်ဆိုတာမျိုးပေါ့။

################################################

Exercises

1. ရေးပြထားတာကို ဖတ်ပြီး if နှစ်ခုနဲ့  else နှစ်ခုအတွက် သက်ဆိုင်ရာ condition တွေ ရေးပေးရပါမယ်။

battery ပမာဏ  50% ထက်နည်းမယ်ဆိုရင် အားသွင်းတဲ့အခါ fast charging mode နဲ့ သွင်းမယ်။ ( c1, p1 )

battery ပမာဏ 50% ထက် မနည်းပဲ 80% ထက်နည်းမယ်ဆိုရင် normal speed နဲ့ အားသွင်းမယ်။ ( c2, p2 )

50% ထက်လည်း မနည်းသလို့ 80% ထက်လည်း မနည်းဘူးဆိုရင် အားသွင်းတဲ့အခါ ဖြည်းဖြည်းချင်းသွင်းမယ်။ ( p3 )

if c1: p1

elif c2: p2

else: p3

if နှစ်ခုနဲ့  else နှစ်ခုအတွက် သက်ဆိုင်ရာ condition တွေ ရေးပေးရပါမယ်။

################################################

2. ကိုယ့်ဘာသာမေးခွန်းထုတ်ပြီး ပြန်ဖြေပါ။

################################################
################################################

34. Control flow 

1. if statement 

if the weather is good, we'll go for a walk
ရာသီဥတုကောင်းလျှင် လမ်းလျှောက်မည်။

then, we'll have lunch
ထို့နောက် နေ့လည်စာစားမည်။

################################################

စိတ်ကူးမှာပါတဲ့ နေလည်စာ စားခြင်းဟာ ရာသီဥတုရဲ့ အခြေအနေနဲ့ မဆိုင်ပါဘူး။

လမ်းလျှောက်ခြင်းကတော့ ရာသီဥတုအခြေအနေနဲ့ သက်ဆိုင်ပါတယ်။

အခြေအနေပေါ်မူတည်ပြီး မှန်မှ အလုပ်လုပ်စေချင်ရင် conditional statement အဖြစ် ဖန်တီးပေးရပါမယ်။

program ရေးရင် ဒီလိုဖြစ်ပါမယ်။

################################################

c1 = weather=="good"
p1 = Walking to Pagoda
p2 = Eat rice for lunch

if  c1: p1

p2

################################################

ပထမအခြေအနေ (c1) မှန်ခဲ့ရင် p1, p2 နှစ်ခုလုံးကို Python က ဘာသာပြန်ပေးပါမယ်။

c1 မှားရင်တော့ p2 တစ်ခုကိုပဲ ဘာသာပြန်ပေးပါ့မယ်။

################################################

Exercise.1

a. ဘာကြောင့် c1 မှားရင် p1 ကို ဘာသာမပြန်ရတာလဲ။

b. c1 မှားသည်ဖြစ်စေ ၊ မှန်သည်ဖြစ်စေ p2 ကို ဘာကြောင့် ဘာသာပြန်ရတာလဲ။

################################################

 2. if-else statement

ရာသီဥတုမကောင်းရင် အိမ်ထဲမှာ program ရေးမယ်ဆိုပြီး ဒုတိယအစီအစဉ်ကို ထပ်ထည့်ပါမယ်။

c1 = weather=="good"
p1 = Walking to Pagoda
p2 = Eat rice for lunch
p3 = Stay at home and write program

if  c1: p1

else: p3

p2

################################################

ရာသီဥတုကောင်းရင် p1 နဲ့ p2 ကို ဘာသာပြန်ပါမယ်။

ရာသီဥတုမကောင်းရင် p3 နဲ့ p2 ကို ဘာသာပြန်ပါမယ်။

################################################

Exercise.2 

ဘာကြောင့် ရာသီဥတုပေါ်မူတည်ပြီး p1 နဲ့ p3 တစ်လှည့်စီဖြစ်ရတာလဲဆိုတာကို ရှင်းပြပါ။

################################################

3. more conditional execution

ရာသီဥတုကောင်းရင်
1. ဘုရားသွားမယ်။
2. ပန်းခြံသွားမယ်။
3. ရုပ်ရှင်ကြည့်မယ်။
စသဖြင့် အများကြီးထည့်ချင်ပါတယ်။

ရာသီဥတုမကောင်းရင်လည်း program ရေး ၊ စာဖတ် ၊ piano တီးပါမယ်။
 
ခုလိုမျိုး တစ်ခုထက်ပိုတဲ့ ညွှန်ကြားချက်တွေ ထည့်ချင်ရင်တော့ space လေးချက်ခြားပြီး ရေးရပါတယ်။

################################################

c1 = weather=="good"

p1 = Walking to Pagoda
p2 = Eat rice for lunch
p3 = Stay at home and write program
p4 = Walking to park
p5 = Going to cinema
p6 = Reading book
p7 = Playing piano
p8 = အဝတ်လျှော်
p9 = ကော်ဖီသောက်
p10 = Going to bed and sleep
p11 = ရေချိုး 

if  c1: 
    p1
    p4
    p5

else: 
    p3
    p6
    p7
   
p2

################################################

Exercise.3

a. ရာသီဥတုကောင်းရင် ဘုရားမသွားခင် အဝတ်လျှော်ပါမယ်။

p8 = အဝတ်လျှော်

p8 ကို if ထဲမှာ ထည့်သင့်လား။ else ထဲမှာ ထည့်သင့်လား။
ဒါမှမဟုတ် ဘယ်နေရာမှာ ထည့်သင့်တယ်လို့ ထင်ပါသလဲ။

################################################

b. ရာသီဥတုမကောင်းရင် program ရေးပြီးရင် ကော်ဖီသောက်ပါမယ်။

p9 = ကော်ဖီသောက်

p9 ကို if ထဲမှာ ထည့်သင့်လား။ else ထဲမှာ ထည့်သင့်လား။
ဒါမှမဟုတ် ဘယ်နေရာမှာ ထည့်သင့်တယ်လို့ ထင်ပါသလဲ။

################################################

c. ရာသီဥတု ကောင်းသည်ဖြစ်‌စေ မကောင်းသည်ဖြစ်စေ နေ့လယ်စာ စားပြီးရင် တစ်ရေးအိပ်ပါမယ်။

p10 = Going to bed and sleep

p10 ကို if ထဲမှာ ထည့်သင့်လား။ else ထဲမှာ ထည့်သင့်လား။
ဒါမှမဟုတ် ဘယ်နေရာမှာ ထည့်သင့်တယ်လို့ ထင်ပါသလဲ။

################################################

d. ရာသီဥတု ကောင်းသည်ဖြစ်‌စေ မကောင်းသည်ဖြစ်စေ နေ့လယ်စာ မစားခင် ရေအရင်ချိုးပါမယ်။

p11 = ရေချိုး 

p11 ကို if ထဲမှာ ထည့်သင့်လား။ else ထဲမှာ ထည့်သင့်လား။
ဒါမှမဟုတ် ဘယ်နေရာမှာ ထည့်သင့်တယ်လို့ ထင်ပါသလဲ။

################################################
"""